/*Задание 1
Дан массив: 
[1, 5, 4, 10, 0, 3]
.

Необходимо создать цикл, который будет выводить элементы массива до тех пор, пока не встретит значение 10.

После вывода значения 10 в консоль цикл должен прекратить свою работу.*/









/*Задание 2
Дан массив: 
[1, 5, 4, 10, 0, 3]
.

Найдите позицию (индекс) числа 4 в этом массиве.

Подсказка: Задачу можно решить методом перебора элементов или используя метод массива indexOf.*/







/*Задание 3
Дан массив чисел: 
[1, 3, 5, 10, 20]
.

С помощью метода 
join
 выведите элементы массива через пробел (пустую строку ' ').*/








/*Задание 4
С помощью вложенных циклов создайте многомерный массив вида: 
[[1, 1, 1], [1, 1, 1], [1, 1, 1]]
.*/







/*Задание 5
Дан массив: 
[1, 1, 1]
.

Добавьте в конец массива значения 2, 2, 2.*/









/*Задание 6
Дан массив: 
[9, 8, 7, 'a', 6, 5]
.

С помощью метода 
sort
 отсортируйте массив и удалите букву 'a' из данного массива. В результате работы программы вывести массив, состоящий из цифр.
*/






/*Задание 7
Дан массив: 
[9, 8, 7, 6, 5]
.

Попросить пользователя угадать число (использовать prompt). Если значение, которое ввёл пользователь, есть в массиве, вывести в alert «Угадал», в противном случае вывести «Не угадал».
*/






/*Задание 8
Дана строка: 
'abcdef'
.

Необходимо, чтобы программа вывела в консоль 
'fedcba'
.*/







/*Задание 9
Дан массив: 
[[1, 2, 3,],[4, 5, 6]]
.

Выведите в консоль массив вида: 
[1, 2, 3, 4, 5, 6]
.
*/







/*Задание 10
Создайте массив с произвольными числами (диапазон от 1 до 10). Переберите его с помощью цикла 
for
 и в каждой итерации выведите в консоль сумму текущего и следующего элементов массива.

Следующий элемент массива можно получить с помощью индекса: 
i + 1
. Обратите внимание, что у последнего элемента нет следующего.
*/









/*Задание 11
Создайте функцию, которая принимает на вход массив целых чисел, а возвращает массив квадратов этих чисел.

Подсказка*/







/*Задание 12
Создайте функцию, которая принимает на вход массив строк, а возвращает массив длины слов.

Пример вызова:

getLengthWords(['слово', '', 'слог', 'длинное предложение', 'буква']); // [5, 0, 4, 19, 5]
*/








/*Задание 13
Создайте функцию, которая принимает на вход массив целых чисел, а возвращает массив содержащий только отрицательные значения.

function filterPositive(array) {
  // Допишите код функции
}

filterPositive([-1, 0, 5, -10, 56]); // => [-1, -10]
filterPositive([-25, 25, 0, -1000, -2]); // => [-25, -1000, -2]*/